# Ввод и вывод данных

# print('Введите a') # Вызываем в консоль 
# a = input() # вводим в консоль 
# print('введите b') # Вызываем в консоль
# b = input() # Вводим в консоль
# c = 30 # Переменная результируюящая
# print(a, '+', b, '=', c) # Печать результата в консоль
# -------------------------------------------------------
# print('Введите a') #вызываем в консоль
# a = int(input()) # то же самое что в первом тролько 
# # в данном случае указываем какой тип данных следует считывать из консоли
# print('Введите b') #вызываем в консоль
# b = int(input()) # то же самое что в первом тролько 
# # в данном случае указываем какой тип данных следует считывать из консоли
# c = 30 # Переменная результируюящая
# print(a, '+', b, '=', c) # Печать результата в консоль
# print('{} + {} = {}'.format(a, b, c)) # Печать результата в консоль только в джругом формате
# ---------------------------------------------------------------------------------------------
# print('Введите a') # Все то же самое только для вещественных чисел
# a = float(input())
# print('Введите b')
# b = float(input())
# c = 100
# print(a, '+' , b, '=', c) 
# print('{} + {} = {}'.format(a, b, c))
# -----------------------------------------------------------------------
# a = int(input('введите a: ')) # практически то же самое, но такая задача 
# # решается только в обдном направлении.
# b = int(input('введите b: '))
# c = 33
# print('{} + {} = {}'.format(a, b, c)) 
# ---------------------------------------------------------------------------
# a = int(input('Введите \na: ')) # То же самое что и предыдущая задача только она уже решпет задачу шире.
# b = int(input('Введите \nb: '))
# c = a + b
# print('{} + {} = {}'.format(a, b, c))
# -----------------------------------------------------------------------------

# Арифметические операции

# exp1 = 2**3 - 10 % 5 + 2 * 3
# exp2 = 2**3 - 10 / 5 + 2 * 3
# print(exp1)
# print(exp2)
# ------------------------------------------------------------
# Сокращенные итерации
# iter = 2    
# iter += 1   iter = iter + 1
# iter -= 3   iter = iter - 3
# iter *= 4   iter = iter * 4        Все в точности так же как и на C#
# iter /= 5   iter = iter / 5
# iter //= 6  iter = iter // 6
# iter %= 7   iter = iter % 7
# iter **= 8  iter = iter ** 8
# ----------------------------------------------------------
# Дополнительно
# a, b, c = 1, 2, 3
# print('a = {}, b = {}, c = {}'.format(a, b, c)) 
# ------------------------------------------------------------

# Логические операции и конструкции типа if, else, else if.

# username = input('Введите имя: ') # Вызываем в консоль
# if(username == 'Инсаф'):   # Задаем условие
#     print('Ура, это же ИНСАФ!') # Оператор 1 то есть тело цикла
# else:  # Иначе
#     print('Привет, ', username) # Оператор n + 1
# ------------------------------------------------------------------
# username = input('введите имя: ')
# if username == 'Инсаф':
#     print('Ура, это же ИНСАФ!')
# elif username == 'Марина':
#     print('Я так ждал Вас МАРИНА!')
# elif username == 'Ильнар':
#     print('Ильнар - топ')
# else:
#     print('Привет, ', username)
# --------------------------------------------------------------------
# Управляющие конструкции типа While
# original = 23
# inverted = 0
# while original != 0:
#     inverted = inverted * 10 + (original % 10)
#     original //= 10
# print(inverted)
# ------------------------------------------------------------------------
# original = 23
# inverted = 0
# while original != 0:
#     inverted = inverted * 10 + (original % 10)
#     original //= 10
# else:
#     print('Пожалуй\nхватит')
# print('inverted = ', inverted)
# ---------------------------------------------------------------------------
# for i in 1, -1, 10, 'hello', 'insaf':
#     print(i)
# ----------------------------------------------------------------------------
# r = range(5)            range(0, 5) # От 0 до 5
# r = range(2, 5)         range(2, 5) # От 2 до 5
# r = range(-5, 0)        range(-5, 0) # От минус 5 до 0
# r = range(1, 10, 2)     range(1, 10, 2) # От 1 до 10 с шагом 2 
# r = range(100, 0, -20)  range(100, 0, -20) # От 100 до 0 с отрицательным шагом -20
# ----------------------------------------------------------------------------
# r = range(100, 0, -20) 
# for i in r:
#     print(i)
# r1 = range(100)
# for j in r1:
#     print(j)
# ----------------------------------------------------------------------------------
# Вложенные циклы
# line = ""
# for i in range(5):
#     line += ""
#     for j in range(5):
#         line += "*"
#     print(line)
# ---------------------------------------------------------------------------------
# Немного о строках
# text = 'съешь еще этих мягких французских булок'
# print(len(text))
# print('мягких' in text)
# print(text.isdigit())
# print(text.islower())
# print(text.replace('съешь', 'Съешь'))
# for c in text:
#     print(c)
# -------------------------------------------------------------------------------
# text = 'съешь еще этих мягких французских булок'
# print(text[23])   # Печатает двадцать третий символ
# print(text[0])   # Печатает нулевой символ
# print(text[len(text) - 5]) # Печатает пятый символ с конца текста
# print(text[-20])  # Печатает двадцатый символ с конца
# print(text[:])   # Печатает весь текст целиком
# print(text[:2])   # Печатает первые два символа с начала текста
# print(text[len(text)-4:])  # Печатает 4 символа с конца текста
# print(text[2:15])  # Печатает текст с второго по пятнадцатый символы
# print(text[6:-18])   # Печатает текст с шестого символа но отсчет с конца
# print(text[0:len(text):6]) # Печатает символы текста с нулевого символа но с шагом 6
# print(text[::6])  # То же самое что и тот пример
# text = text[2:9] + text[-5] + text[1:2]  # Можно из одного текста составить множество других 
# print(text)
# text = text[-8] + text[-14] + text[0] + text[-15] + text[-17]
# print(text)
# ------------------------------------------------------------------------------------------
# Списки введение
# numbers = [1, 2, 3, 4, 5]
# print(numbers)
# numbers = list(range(1, 6))
# print(numbers)
# numbers[0] = 10
# print(numbers)
# for i in numbers:
#     i *= 2
#     print(list([i]))
# print(numbers)
# ---------------------------------------------------------------------------------------------
# colors = ['red', 'green', 'blue', 'yellow', 'white', 'black']
# # for k in colors:
# #     print(k)
# # for e in colors:
#     # print(e * 2)
# colors.append('gray')
# print(colors)
# colors.remove('green')
# print(colors)
# ------------------------------------------------------------------------------------------------
# Функции
# def f(x):         # Сама функция
#     return x**2

# def f(x):
#     if x % 2 == 0:
#         return 'Целое'
#     else:
#         return 'Не целое'
# print(f(4))